# Data Cleaning Using Pandas

The goal in this project is to work on my data cleanihng skills using Python:


## Data Cleaning Steps:



### Questions of the data

For this DataFrame, the goal was to answer the following questions after cleaning:
- Who are the employees
- What is the lowest salary
- What is the highest salary
- 3 cities make the highest
- 2 cities who make the lowest
- What is the total salaries being paid out to the employees annually.
- Create visualization of the data.

In [412]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [413]:
# Create a dictionary with sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', None, 'Eve', 'Bob', 'Frank', 'Grace', 'Hannah', 'Ivy'],
    'Age': [25, 30, 'thirty-five', 40, None, 30, 29, '', 22, 22],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Los Angeles', None, 'San Francisco', 'Chicago', 'Miami'],
    'Salary': [70000, 80000, 120000, None, 60000, 80000, 50000, 75000, 85000, 90000]
}

In [414]:
# Create the DataFrame
df = pd.DataFrame(data)
print(df)
print(df.columns)

      Name          Age           City    Salary
0    Alice           25       New York   70000.0
1      Bob           30    Los Angeles   80000.0
2  Charlie  thirty-five        Chicago  120000.0
3     None           40        Houston       NaN
4      Eve         None        Phoenix   60000.0
5      Bob           30    Los Angeles   80000.0
6    Frank           29           None   50000.0
7    Grace               San Francisco   75000.0
8   Hannah           22        Chicago   85000.0
9      Ivy           22          Miami   90000.0
Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

# Data Cleaning:

In [415]:
# Dropped all duplicates
# Row 5: is also Bob ROW 1

df.drop_duplicates(inplace=True)
print(df)

      Name          Age           City    Salary
0    Alice           25       New York   70000.0
1      Bob           30    Los Angeles   80000.0
2  Charlie  thirty-five        Chicago  120000.0
3     None           40        Houston       NaN
4      Eve         None        Phoenix   60000.0
6    Frank           29           None   50000.0
7    Grace               San Francisco   75000.0
8   Hannah           22        Chicago   85000.0
9      Ivy           22          Miami   90000.0

In [416]:
# Remove all NaN or empty records

print(df.dropna(inplace=True))
print(df)

None
      Name          Age           City    Salary
0    Alice           25       New York   70000.0
1      Bob           30    Los Angeles   80000.0
2  Charlie  thirty-five        Chicago  120000.0
7    Grace               San Francisco   75000.0
8   Hannah           22        Chicago   85000.0
9      Ivy           22          Miami   90000.0

In [417]:
df2 = (df.drop('Age', axis=1))
print(df2)

      Name           City    Salary
0    Alice       New York   70000.0
1      Bob    Los Angeles   80000.0
2  Charlie        Chicago  120000.0
7    Grace  San Francisco   75000.0
8   Hannah        Chicago   85000.0
9      Ivy          Miami   90000.0

# Data Analysis: 


Questions of the Data.

For this DataFrame, the goal was to answer the following questions after cleaning:
- Who are the employees?
- What is the lowest salary?
- What is the highest salary?
- 3 cities make the highest?
- 2 cities who make the lowest?
- What is the total salaries being paid out to the employees annually?

In [418]:
# Who are the employees?

print(df2['Name'])

0      Alice
1        Bob
2    Charlie
7      Grace
8     Hannah
9        Ivy
Name: Name, dtype: object

In [419]:
print(df2.Salary.min()) # minimum salary 70000.0

70000.0

In [420]:
print(df2.Salary.max()) # maximum salary 120000.0

120000.0

In [421]:
df2 # print df

      Name           City    Salary
0    Alice       New York   70000.0
1      Bob    Los Angeles   80000.0
2  Charlie        Chicago  120000.0
7    Grace  San Francisco   75000.0
8   Hannah        Chicago   85000.0
9      Ivy          Miami   90000.0

In [422]:
print(df2.Salary.sum()) # 520000.0 is the total salary sum of all employees.

520000.0